{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv_0", "class_name": "Conv2D", "config": {"name": "conv_0", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "bnorm_0", "class_name": "BatchNormalization", "config": {"name": "bnorm_0", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_0", 0, 0, {}]]]}, {"name": "leaky_0", "class_name": "LeakyReLU", "config": {"name": "leaky_0", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_0", 0, 0, {}]]]}, {"name": "maxpool_1", "class_name": "MaxPooling2D", "config": {"name": "maxpool_1", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_0", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "Conv2D", "config": {"name": "conv_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_1", 0, 0, {}]]]}, {"name": "bnorm_2", "class_name": "BatchNormalization", "config": {"name": "bnorm_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"name": "leaky_2", "class_name": "LeakyReLU", "config": {"name": "leaky_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_2", 0, 0, {}]]]}, {"name": "maxpool_3", "class_name": "MaxPooling2D", "config": {"name": "maxpool_3", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_2", 0, 0, {}]]]}, {"name": "conv_4", "class_name": "Conv2D", "config": {"name": "conv_4", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_3", 0, 0, {}]]]}, {"name": "bnorm_4", "class_name": "BatchNormalization", "config": {"name": "bnorm_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"name": "leaky_4", "class_name": "LeakyReLU", "config": {"name": "leaky_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_4", 0, 0, {}]]]}, {"name": "maxpool_5", "class_name": "MaxPooling2D", "config": {"name": "maxpool_5", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_4", 0, 0, {}]]]}, {"name": "conv_6", "class_name": "Conv2D", "config": {"name": "conv_6", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_5", 0, 0, {}]]]}, {"name": "bnorm_6", "class_name": "BatchNormalization", "config": {"name": "bnorm_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_6", 0, 0, {}]]]}, {"name": "leaky_6", "class_name": "LeakyReLU", "config": {"name": "leaky_6", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_6", 0, 0, {}]]]}, {"name": "maxpool_7", "class_name": "MaxPooling2D", "config": {"name": "maxpool_7", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_6", 0, 0, {}]]]}, {"name": "conv_8", "class_name": "Conv2D", "config": {"name": "conv_8", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_7", 0, 0, {}]]]}, {"name": "bnorm_8", "class_name": "BatchNormalization", "config": {"name": "bnorm_8", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_8", 0, 0, {}]]]}, {"name": "leaky_8", "class_name": "LeakyReLU", "config": {"name": "leaky_8", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_8", 0, 0, {}]]]}, {"name": "maxpool_9", "class_name": "MaxPooling2D", "config": {"name": "maxpool_9", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_8", 0, 0, {}]]]}, {"name": "conv_10", "class_name": "Conv2D", "config": {"name": "conv_10", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_9", 0, 0, {}]]]}, {"name": "bnorm_10", "class_name": "BatchNormalization", "config": {"name": "bnorm_10", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_10", 0, 0, {}]]]}, {"name": "leaky_10", "class_name": "LeakyReLU", "config": {"name": "leaky_10", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_10", 0, 0, {}]]]}, {"name": "maxpool_11", "class_name": "MaxPooling2D", "config": {"name": "maxpool_11", "trainable": true, "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["leaky_10", 0, 0, {}]]]}, {"name": "conv_12", "class_name": "Conv2D", "config": {"name": "conv_12", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["maxpool_11", 0, 0, {}]]]}, {"name": "bnorm_12", "class_name": "BatchNormalization", "config": {"name": "bnorm_12", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_12", 0, 0, {}]]]}, {"name": "leaky_12", "class_name": "LeakyReLU", "config": {"name": "leaky_12", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_12", 0, 0, {}]]]}, {"name": "conv_13", "class_name": "Conv2D", "config": {"name": "conv_13", "trainable": true, "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_12", 0, 0, {}]]]}, {"name": "bnorm_13", "class_name": "BatchNormalization", "config": {"name": "bnorm_13", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_13", 0, 0, {}]]]}, {"name": "leaky_13", "class_name": "LeakyReLU", "config": {"name": "leaky_13", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_13", 0, 0, {}]]]}, {"name": "conv_18", "class_name": "Conv2D", "config": {"name": "conv_18", "trainable": true, "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_13", 0, 0, {}]]]}, {"name": "bnorm_18", "class_name": "BatchNormalization", "config": {"name": "bnorm_18", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_18", 0, 0, {}]]]}, {"name": "leaky_18", "class_name": "LeakyReLU", "config": {"name": "leaky_18", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_18", 0, 0, {}]]]}, {"name": "upsample_19", "class_name": "UpSampling2D", "config": {"name": "upsample_19", "trainable": true, "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["leaky_18", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["upsample_19", 0, 0, {}], ["leaky_8", 0, 0, {}]]]}, {"name": "conv_14", "class_name": "Conv2D", "config": {"name": "conv_14", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_13", 0, 0, {}]]]}, {"name": "conv_21", "class_name": "Conv2D", "config": {"name": "conv_21", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "bnorm_14", "class_name": "BatchNormalization", "config": {"name": "bnorm_14", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_14", 0, 0, {}]]]}, {"name": "bnorm_21", "class_name": "BatchNormalization", "config": {"name": "bnorm_21", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv_21", 0, 0, {}]]]}, {"name": "leaky_14", "class_name": "LeakyReLU", "config": {"name": "leaky_14", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_14", 0, 0, {}]]]}, {"name": "leaky_21", "class_name": "LeakyReLU", "config": {"name": "leaky_21", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["bnorm_21", 0, 0, {}]]]}, {"name": "conv_15", "class_name": "Conv2D", "config": {"name": "conv_15", "trainable": true, "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_14", 0, 0, {}]]]}, {"name": "conv_22", "class_name": "Conv2D", "config": {"name": "conv_22", "trainable": true, "filters": 18, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["leaky_21", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["conv_15", 0, 0], ["conv_22", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of5.bin", "group1-shard2of5.bin", "group1-shard3of5.bin", "group1-shard4of5.bin", "group1-shard5of5.bin"], "weights": [{"name": "bnorm_0/gamma", "shape": [16], "dtype": "float32"}, {"name": "bnorm_0/beta", "shape": [16], "dtype": "float32"}, {"name": "bnorm_0/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "bnorm_0/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "bnorm_10/gamma", "shape": [256], "dtype": "float32"}, {"name": "bnorm_10/beta", "shape": [256], "dtype": "float32"}, {"name": "bnorm_10/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bnorm_10/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bnorm_12/gamma", "shape": [512], "dtype": "float32"}, {"name": "bnorm_12/beta", "shape": [512], "dtype": "float32"}, {"name": "bnorm_12/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bnorm_12/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bnorm_13/gamma", "shape": [256], "dtype": "float32"}, {"name": "bnorm_13/beta", "shape": [256], "dtype": "float32"}, {"name": "bnorm_13/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bnorm_13/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bnorm_14/gamma", "shape": [512], "dtype": "float32"}, {"name": "bnorm_14/beta", "shape": [512], "dtype": "float32"}, {"name": "bnorm_14/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "bnorm_14/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "bnorm_18/gamma", "shape": [128], "dtype": "float32"}, {"name": "bnorm_18/beta", "shape": [128], "dtype": "float32"}, {"name": "bnorm_18/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bnorm_18/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "bnorm_2/gamma", "shape": [32], "dtype": "float32"}, {"name": "bnorm_2/beta", "shape": [32], "dtype": "float32"}, {"name": "bnorm_2/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "bnorm_2/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "bnorm_21/gamma", "shape": [256], "dtype": "float32"}, {"name": "bnorm_21/beta", "shape": [256], "dtype": "float32"}, {"name": "bnorm_21/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bnorm_21/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "bnorm_4/gamma", "shape": [64], "dtype": "float32"}, {"name": "bnorm_4/beta", "shape": [64], "dtype": "float32"}, {"name": "bnorm_4/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "bnorm_4/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "bnorm_6/gamma", "shape": [128], "dtype": "float32"}, {"name": "bnorm_6/beta", "shape": [128], "dtype": "float32"}, {"name": "bnorm_6/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "bnorm_6/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "bnorm_8/gamma", "shape": [256], "dtype": "float32"}, {"name": "bnorm_8/beta", "shape": [256], "dtype": "float32"}, {"name": "bnorm_8/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "bnorm_8/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv_0/kernel", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "conv_10/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv_12/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv_13/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "conv_14/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv_15/kernel", "shape": [1, 1, 512, 18], "dtype": "float32"}, {"name": "conv_15/bias", "shape": [18], "dtype": "float32"}, {"name": "conv_18/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "conv_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "conv_21/kernel", "shape": [3, 3, 384, 256], "dtype": "float32"}, {"name": "conv_22/kernel", "shape": [1, 1, 256, 18], "dtype": "float32"}, {"name": "conv_22/bias", "shape": [18], "dtype": "float32"}, {"name": "conv_4/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv_6/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv_8/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}]}]}